{
  "framework": {
    "core_principles": [
      "Maintain objectivity and neutrality in reporting.",
      "Use precise and accurate data to support claims.",
      "Ensure clarity and coherence in paragraph structure.",
      "Integrate quotes seamlessly to enhance credibility.",
      "Employ formal and analytical tone throughout.",
      "Provide context through historical or comparative analysis.",
      "Use concrete examples to illustrate points.",
      "Attribute information to credible sources.",
      "Highlight implications or future outlooks where relevant.",
      "Avoid speculation and unverified information."
    ],
    "sentence_patterns": [
      {
        "pattern": "Subject + active verb + object",
        "example": "Kaztransoil announced the shipment."
      },
      {
        "pattern": "Subject + verb + prepositional phrase",
        "example": "Kazakhstan exported oil to Germany."
      },
      {
        "pattern": "Subject + verb + conjunction + clause",
        "example": "The group said smuggling activity has surged."
      },
      {
        "pattern": "Introductory phrase + subject + verb + object",
        "example": "Following the announcement, the company revised its forecast."
      },
      {
        "pattern": "Subject + passive verb + by agent",
        "example": "The rally was fueled by renewed bets."
      }
    ],
    "vocabulary_guide": {
      "always_use": [
        "announced",
        "reported",
        "highlighted",
        "emphasized",
        "warned"
      ],
      "often_use": [
        "expressed",
        "allocated",
        "approved",
        "introduced",
        "secured"
      ],
      "never_use": [
        "claimed",
        "alleged",
        "supposed",
        "rumored",
        "hinted"
      ]
    },
    "lead_formula": [
      "Start with a direct statement of a key event or development.",
      "Introduce significant figures or authorities involved.",
      "Provide context or background information.",
      "Highlight the impact or implications of the event.",
      "Example: 'Kazakhstan's central bank announced a new monetary policy on October 2, aiming to stabilize the national currency amid rising inflation.'"
    ],
    "attribution_rules": [
      "Use phrases like 'according to', 'reported by', or 'citing official data'.",
      "Attribute direct quotes to named individuals or organizations.",
      "Mention the source publication or agency for credibility.",
      "For anonymous sources, provide a reason for anonymity.",
      "Example: 'According to Reuters, the new policy is expected to boost economic growth.'"
    ],
    "tone_guidelines": [
      "Maintain a formal and objective tone.",
      "Be informative and analytical, avoiding personal opinions.",
      "Ensure neutrality, especially in contentious topics.",
      "Use concise language to convey information clearly.",
      "Avoid sensationalism or emotional language."
    ],
    "structure_template": [
      "Lead: Introduce the main event or development.",
      "Background: Provide context or historical information.",
      "Details: Elaborate on the event with data and quotes.",
      "Analysis: Discuss implications or potential outcomes.",
      "Conclusion: Summarize key points and future outlooks."
    ],
    "style_nuances": [
      "Use specific figures and percentages for precision.",
      "Integrate data into the narrative to support claims.",
      "Employ transitions like 'However', 'Furthermore', and 'In addition' for coherence.",
      "Focus each paragraph on a single aspect of the topic.",
      "Conclude paragraphs with a sentence that ties back to the main idea."
    ],
    "common_mistakes": [
      "Using vague or unverified information.",
      "Failing to attribute sources properly.",
      "Overusing passive voice, which can obscure responsibility.",
      "Including personal opinions or biases.",
      "Neglecting to provide context for data or quotes."
    ],
    "quality_checklist": [
      "Verify all data and statistics for accuracy.",
      "Ensure all sources are credible and properly attributed.",
      "Check for clarity and coherence in paragraph structure.",
      "Review for consistent tone and style throughout.",
      "Confirm that the article provides a balanced perspective."
    ]
  },
  "example_articles": [
    {
      "title": "Tehran Friday prayers speaker says Iran will plough Tel Aviv and Haifa",
      "opening_paragraph": "Iran's temporary Friday prayer leader has declared that demands to halt uranium enrichment are 'unacceptable', saying that the Islamic Republic will not submit to US and European pressure.Firebrand cleric Ahmad Khatami, speaking during the second sermon of Tehran’s Friday prayers on October 3, echoed Supreme Leader Ali Khamenei’s stance on the necessity of uranium enrichment for medical, agricultural, and environmental purposes, ISNA reported on October 3.“If any person or government says ‘no en"
    },
    {
      "title": "Tanzania pushes for $42bn LNG deal with Shell, Equinor by end-2025 after decades of delays",
      "opening_paragraph": "Tanzania is moving closer to finalising terms for a $42bn liquefied natural gas (LNG) project at Likong’o in Lindi, with a deal expected before the end of 2025, the state-owned Daily News reported.The development has been under negotiation for more than a decade and is intended to anchor one of the largest energy investments in Africa. The plan envisages output of up to 10mn tonnes of LNG annually, drawing on offshore reserves operated by Shell (UK, Blocks 1 & 4) and Equinor (Norway, Block 2).Bl"
    },
    {
      "title": "Water scarcity forces a rethink of Tehran's dominance",
      "opening_paragraph": "When Iran’s President Masoud Pezeshkian broached the idea of relocating Iran's capital southward to the Persian Gulf coast in 2024, he was ridiculed. This year, on October 1, during a visit to Hormozgan province, Iran's president returned to the theme with renewed urgency. The proposal, he insisted, is no longer a matter of choice but of survival. Tehran is running out of water­ — fast.A plan to move the economic and political capital of more than 9mn people in the main metropolitan area has bee"
    },
    {
      "title": "Botala Energy posts wider loss, sets 2027/28 target for first gas in Botswana",
      "opening_paragraph": "Botala Energy (ASX: BTE, BSE: BOTALA) has reported a wider annual loss as it advances efforts to monetise coal bed methane (CBM) reserves in Botswana. The Australian junior posted a net after-tax loss of AUD 2.91mn (about $1.9mn) for the year to June 30, compared with AUD 2.07mn in the prior period, according to its annual report.“Over the last 12 months, Botala has achieved a series of important milestones that continue our transition from an exploration-focused business to a developer and prod"
    },
    {
      "title": "LONG READ: Trade is the glue that holds Global Emerging Markets Institutions together",
      "opening_paragraph": "The world order is changing. The emerging markets are coming of age and they are setting up a raft of largely non-Western Global Emerging Markets Institutions (GEMIs) to coordinate their lives.An alphabet soup of organisations has emerged – BRICS+, G20 , the Shanghai Cooperation Organization (SCO), Eurasian Economic Union (EUU), ASEAN (Association of Southeast Asian Nations), the African Union, to name a few – but unlike their Developed Market (DM) peers, these organisations remain immature and "
    },
    {
      "title": "Kazakhstan appoints AI board member to sovereign wealth fund, awards voting rights",
      "opening_paragraph": "Kazakhstan’s sovereign wealth fund, Samruk-Kazyna, on October 2 unveiled an artificial intelligence-based member of its board of directors, complete with voting rights.The Samruk-Kazyna Artificial Intelligence Neural Network, known as SKAI, was introduced to the country’s president, Kassym-Jomart Tokayev, on October 2 during the Digital Bridge 2025 international tech forum held in Astana. One of the guests, Telegram cross-platform founder Pavel Durov, used the event to announce the creation of a"
    },
    {
      "title": "Ukraine warns Poland over President Nawrocki’s bill targeting nationalist symbols",
      "opening_paragraph": "Ukraine will be “forced to take retaliatory measures” if Poland passes a bill equating the Ukrainian nationalist movement with Nazism and communism, Ukrainian historians said on October 1.The episode marks the latest flare-up in tensions between the two allies over the legacy of the Second World War and the Volhynia massacres, in which around 100,000 ethnic Poles were killed by Ukrainian nationalists.Nawrocki this week submitted legislation that would expand Poland’s criminal code, which already"
    },
    {
      "title": "Venezuela accuses US of flying combat jets near its waters",
      "opening_paragraph": "Venezuelan authorities have condemned what they describe as an unauthorised US military operation near the country's Caribbean waters, with officials in Caracas calling the incident a serious breach of international aviation law. Defence Minister Vladimir Padrino said on October 2 that radar systems had tracked five American F-35 combat aircraft at high altitude approximately 75 kilometres off earlier the same day. 'They are combat aircraft. Combat aircraft that US imperialism has dared to appro"
    },
    {
      "title": "Uganda and Sudan strengthen military cooperation amid regional security concerns",
      "opening_paragraph": "Uganda’s Chief of Defence Forces, General Muhoozi Kainerugaba, has met Sudan’s Ambassador to Uganda, Ahmed Ibrahim Ahmed, at the Special Forces Command headquarters in Entebbe to discuss restoring and strengthening military cooperation between the two countries, NilePost reported. 'Uganda has consistently demonstrated commitment to regional peace and stability. We are eager to restore and strengthen military cooperation between our two countries,' Ahmed is quoted as saying. Kainerugaba welcomed "
    },
    {
      "title": "Hungarian PM isolated at EU summit over Ukraine stance",
      "opening_paragraph": "Hungarian Prime Minister Viktor Orban was increasingly isolated at the informal EU summit in Copenhagen, his sharply critical stance on the idea of financing aid to Ukraine from frozen Russian assets contrasting with the positions of fellow EU leaders. At the summit, Belgian Prime Minister Bart De Wever urged EU leaders to guarantee that they will jointly bear the risks of using frozen Russian assets, most of which are held in Belgium, to finance loans for Ukraine. All leaders except Orban backe"
    }
  ],
  "version": "2.0",
  "articles_analyzed": 300
}