{
  "framework": {
    "core_principles": [
      "Maintain objectivity and neutrality in reporting.",
      "Use precise and clear language to enhance readability.",
      "Incorporate expert opinions and analysis to add depth.",
      "Provide historical context to frame current events.",
      "Balance quantitative data with qualitative insights.",
      "Use concrete examples to illustrate points.",
      "Highlight contrasts or contradictions to provide clarity.",
      "Employ cause-and-effect reasoning to explain developments.",
      "Ensure all data is sourced from credible organizations.",
      "Integrate quotes seamlessly to support the narrative."
    ],
    "sentence_patterns": [
      {
        "pattern": "Subject + active verb + object",
        "example": "The government announced new economic reforms."
      },
      {
        "pattern": "Subject + verb + prepositional phrase",
        "example": "The report was released by the Ministry of Finance."
      },
      {
        "pattern": "Introductory clause + main clause",
        "example": "Despite economic challenges, the country achieved growth."
      },
      {
        "pattern": "Subject + verb + direct object + indirect object",
        "example": "The company offered investors a detailed report."
      },
      {
        "pattern": "Complex sentences with dependent and independent clauses",
        "example": "While the economy is growing, unemployment remains high."
      }
    ],
    "vocabulary_guide": {
      "always_use": [
        "economic diversification",
        "bilateral trade",
        "financial constraints",
        "regulatory approval",
        "political struggles"
      ],
      "often_use": [
        "indicate",
        "highlight",
        "report",
        "project",
        "forecast"
      ],
      "never_use": [
        "slang",
        "colloquialisms",
        "overly technical jargon without explanation",
        "emotional language"
      ]
    },
    "lead_formula": [
      "Start with a significant event or decision.",
      "Introduce a key figure or entity involved.",
      "Present a problem or challenge faced.",
      "Highlight a recent development or change in policy.",
      "Set the scene with geographical or political context."
    ],
    "attribution_rules": [
      "Use phrases like 'according to', 'as reported by', and 'said'.",
      "Cite sources with specific references to organizations or individuals.",
      "Include the speaker's name and position for direct quotes.",
      "Provide context for the authority of the source.",
      "Example: 'According to the Ministry of Energy, the new policy will...'"
    ],
    "tone_guidelines": [
      "Maintain an objective and neutral tone throughout.",
      "Be informative and analytical, avoiding emotional language.",
      "Use formal language appropriate for a professional audience.",
      "Ensure the tone is factual and cautious when necessary."
    ],
    "structure_template": [
      "Lead: Use the lead formula to introduce the main topic.",
      "Body: Develop the story with supporting details, data, and quotes.",
      "Analysis: Provide expert opinions and historical context.",
      "Conclusion: Summarize key points and suggest implications or future developments."
    ],
    "style_nuances": [
      "Use transitions like 'However', 'Meanwhile', and 'Furthermore' to maintain flow.",
      "Present numbers and statistics with precision and context.",
      "Integrate quotes to provide authority and perspective.",
      "Highlight trends and contrasts to enhance understanding."
    ],
    "common_mistakes": [
      "Using slang or colloquial language.",
      "Failing to provide context for data or quotes.",
      "Overusing technical jargon without explanation.",
      "Allowing bias or emotional language to influence tone."
    ],
    "quality_checklist": [
      "Verify all data and statistics for accuracy.",
      "Ensure all sources are credible and properly cited.",
      "Check for clarity and conciseness in language.",
      "Review for objectivity and neutrality in tone.",
      "Confirm that quotes are integrated and attributed correctly."
    ]
  },
  "example_articles": [
    {
      "title": "EU presses ahead with December signing of divisive Mercosur deal",
      "opening_paragraph": "The European Commission is gearing up to sign its contentious trade agreement with South American bloc Mercosur on December 5 in Brazil, according to four EU diplomats who spoke to Politico, possibly sealing the fate of an accord that has languished in negotiations for more than a quarter-century.The proposed timeline would see EU ambassadors deliberate on the agreement on December 3 before a formal signing ceremony during a planned EU-Mercosur summit in Brazil two days later, the diplomats told"
    },
    {
      "title": "September PMI confirms Turkish manufacturers have struggled with rough times for year and half",
      "opening_paragraph": "Turkish manufacturers continued to suffer a challenging demand environment in September, according to the Istanbul Chamber of Industry Türkiye Manufacturing Purchasing Managers’ Index (PMI) released on October 1 by S&P Global.Business conditions in Turkey’s manufacturing industry have now moderated on a monthly basis for a year-and-a-half.The headline PMI posted 46.7 in September, down from 47.3 in August (any figure below 50.9 denotes a deterioration).The September data indicates further slowdo"
    },
    {
      "title": "Mexican tycoon Carlos Slim invests $2bn in Veracruz oil field as Pemex drowns in debt",
      "opening_paragraph": "Mexican businessman Carlos Slim, the country's richest man, has expanded his involvement in the country's hydrocarbons sector through a new drilling agreement with state-owned oil company Petróleos Mexicanos (Pemex). His conglomerate Grupo Carso confirmed it will invest up to $1.991bn in the development of 32 wells at the Ixachi onshore field in Veracruz.The contract, signed through Carso subsidiaries GSM Bronco and MX DLTA NRG 1, covers a three-year programme for drilling and completion. Accord"
    },
    {
      "title": "NG.Cash wins Brazil credit licence",
      "opening_paragraph": "Brazilian neobank NG.Cash has secured regulatory approval to operate as a direct credit company after acquiring BizCapital’s licence, the firm said in a press release.The Central Bank concluded the authorisation process this year, finalising a transaction that began in 2023. The entity is now formally registered as NG.Cash Sociedade de Crédito Direto S.A.Launched in 2018 as Neagle Bank and renamed in 2021, NG.Cash focuses on Generation Z customers. Its platform provides a digital account, prepai"
    },
    {
      "title": "Somalia to launch first oil drilling campaign within months, after decades of exploration, says president",
      "opening_paragraph": "Somalia’s President Hassan Sheikh Mohamud has announced the launch of the country’s first-ever oil drilling campaign in the coming months, local outlet Shabelle Media Network reported.Mohamud said the exploration campaign represented a vital step in Somalia’s efforts to unlock its potentially vast hydrocarbon resources and lay the foundations for long-term economic growth, signalling the start of a new chapter for the Horn of Africa country. “For the first time, Somalia will begin drilling a wel"
    },
    {
      "title": "Slovenia confronts its ageing challenge with contested pension reform",
      "opening_paragraph": "The battle over the comprehensive reform of Slovenia’s pension system is shaping up to be one of the small country’s defining political struggles of the decade.The overhaul of the pension system in Slovenia, an EU country with a population of slightly over 2mn, has been discussed for years as a response to the country’s ageing population. However, the reform, hailed by the government as a long-overdue step towards securing sustainable public finances, is seen by critics as an unfair burden on wo"
    },
    {
      "title": "Afghanistan grinds to a halt as Taliban cuts off internet",
      "opening_paragraph": "A sweeping internet shutdown across Afghanistan by the Taliban authorities has paralysed cross-border trade and disconnected millions of web users in what has been described as a disaster for the country.At the Dogharoun border crossing, nearly 800 Iranian and Afghan lorries were stranded mounting further problems with perishable food items beginning to perish in the heat while emergency items including medical supplies were also held up, according to Iranian media.The blackout stems from a nati"
    },
    {
      "title": "VISEGRAD BLOG: Will Czechia drift into Slovak and Hungarian direction after this week’s elections?",
      "opening_paragraph": "Czechia’s largest opposition party, billionaire ex-prime minister Andrej Babiš’ populist ANO, is widely expected to win the parliamentary elections scheduled for October 3-4. This would be a remarkable comeback after Babiš was narrowly ousted by a bloc of pro-Western parties in 2021 on the back of mass protests against his cabinet.With ANO’s return looking highly likely, the question now is what direction the party will lead Czechia in. Specifically, whether Czechia will join its neighbour Slova"
    },
    {
      "title": "Milei to meet Trump at White House as Argentina seeks $20bn swap before election",
      "opening_paragraph": "Argentine President Javier Milei will meet US President Donald Trump at the White House on October 14, less than two weeks before congressional elections that could determine the fate of the libertarian leader's economic reforms.The bilateral meeting, confirmed by Argentina's foreign ministry on September 30, follows a previous one on the sidelines of the UNGA last week and represents the latest sign of deepening ties between the ideological allies as Washington deploys an array of financial ins"
    },
    {
      "title": "Landmark US–Africa trade deal expires, threatening thousands of jobs",
      "opening_paragraph": "The expiration of the African Growth and Opportunity Act (AGOA) on September 30 has left exporters across sub-Saharan Africa bracing for sharp losses, as Washington failed to extend the long-running trade preference scheme. Without renewal, African governments and companies warn they will be forced to seek alternative markets or negotiate bilateral deals to preserve access.Introduced in 2000 under President Bill Clinton, the programme gave countries duty-free access to more than 6,800 tariff lin"
    }
  ],
  "version": "2.0",
  "articles_analyzed": 300
}